ArduPilot/ardupilot/modules/ChibiOS/os/common/ext/ST/STM32U5xx/stm32u5a9xx.h
/********************  Bit definition for PWR_PDCRJ register  *****************/
#define PWR_PDCRJ_PD0_Pos                   (0U)
#define PWR_PDCRJ_PD0_Msk                   (0x1UL << PWR_PDCRJ_PD0_Pos)            /*!< 0x00000001 */
#define PWR_PDCRJ_PD0                       PWR_PDCRJ_PD0_Msk                       /*!< Apply pull-down for PJ0  */
#define PWR_PDCRJ_PD1_Pos                   (1U)
#define PWR_PDCRJ_PD1_Msk                   (0x1UL << PWR_PDCRJ_PD1_Pos)            /*!< 0x00000002 */
#define PWR_PDCRJ_PD1                       PWR_PDCRJ_PD1_Msk                       /*!< Apply pull-down for PJ1  */
#define PWR_PDCRJ_PD2_Pos                   (2U)
#define PWR_PDCRJ_PD2_Msk                   (0x1UL << PWR_PDCRJ_PD2_Pos)            /*!< 0x00000004 */
#define PWR_PDCRJ_PD2                       PWR_PDCRJ_PD2_Msk                       /*!< Apply pull-down for PJ2  */
#define PWR_PDCRJ_PD3_Pos                   (3U)
#define PWR_PDCRJ_PD3_Msk                   (0x1UL << PWR_PDCRJ_PD3_Pos)            /*!< 0x00000008 */
#define PWR_PDCRJ_PD3                       PWR_PDCRJ_PD3_Msk                       /*!< Apply pull-down for PJ3  */
#define PWR_PDCRJ_PD4_Pos                   (4U)
#define PWR_PDCRJ_PD4_Msk                   (0x1UL << PWR_PDCRJ_PD4_Pos)            /*!< 0x00000010 */
#define PWR_PDCRJ_PD4                       PWR_PDCRJ_PD4_Msk                       /*!< Apply pull-down for PJ4  */
#define PWR_PDCRJ_PD5_Pos                   (5U)
#define PWR_PDCRJ_PD5_Msk                   (0x1UL << PWR_PDCRJ_PD5_Pos)            /*!< 0x00000020 */
#define PWR_PDCRJ_PD5                       PWR_PDCRJ_PD5_Msk                       /*!< Apply pull-down for PJ5  */
#define PWR_PDCRJ_PD6_Pos                   (6U)
#define PWR_PDCRJ_PD6_Msk                   (0x1UL << PWR_PDCRJ_PD6_Pos)            /*!< 0x00000040 */
#define PWR_PDCRJ_PD6                       PWR_PDCRJ_PD6_Msk                       /*!< Apply pull-down for PJ6  */
#define PWR_PDCRJ_PD7_Pos                   (7U)
#define PWR_PDCRJ_PD7_Msk                   (0x1UL << PWR_PDCRJ_PD7_Pos)            /*!< 0x00000080 */
#define PWR_PDCRJ_PD7                       PWR_PDCRJ_PD7_Msk                       /*!< Apply pull-down for PJ7  */
#define PWR_PDCRJ_PD8_Pos                   (8U)
#define PWR_PDCRJ_PD8_Msk                   (0x1UL << PWR_PDCRJ_PD8_Pos)            /*!< 0x00000100 */
#define PWR_PDCRJ_PD8                       PWR_PDCRJ_PD8_Msk                       /*!< Apply pull-down for PJ8  */
#define PWR_PDCRJ_PD9_Pos                   (9U)
#define PWR_PDCRJ_PD9_Msk                   (0x1UL << PWR_PDCRJ_PD9_Pos)            /*!< 0x00000200 */
#define PWR_PDCRJ_PD9                       PWR_PDCRJ_PD9_Msk                       /*!< Apply pull-down for PJ9  */
#define PWR_PDCRJ_PD10_Pos                  (10U)
#define PWR_PDCRJ_PD10_Msk                  (0x1UL << PWR_PDCRJ_PD10_Pos)           /*!< 0x00000400 */
#define PWR_PDCRJ_PD10                      PWR_PDCRJ_PD10_Msk                      /*!< Apply pull-down for PJ10 */
#define PWR_PDCRJ_PD11_Pos                  (11U)
#define PWR_PDCRJ_PD11_Msk                  (0x1UL << PWR_PDCRJ_PD11_Pos)           /*!< 0x00000800 */
#define PWR_PDCRJ_PD11                      PWR_PDCRJ_PD11_Msk                      /*!< Apply pull-down for PJ11 */

/********************  Bit definition for PWR_CR4 register  *******************/
#define PWR_CR4_SRAM1PDS4_Pos               (0U)
#define PWR_CR4_SRAM1PDS4_Msk               (0x1UL << PWR_CR4_SRAM1PDS4_Pos)        /*!< 0x00000001 */
#define PWR_CR4_SRAM1PDS4                   PWR_CR4_SRAM1PDS4_Msk                   /*!< SRAM1 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM1PDS5_Pos               (1U)
#define PWR_CR4_SRAM1PDS5_Msk               (0x1UL << PWR_CR4_SRAM1PDS5_Pos)        /*!< 0x00000002 */
#define PWR_CR4_SRAM1PDS5                   PWR_CR4_SRAM1PDS5_Msk                   /*!< SRAM1 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM1PDS6_Pos               (2U)
#define PWR_CR4_SRAM1PDS6_Msk               (0x1UL << PWR_CR4_SRAM1PDS6_Pos)        /*!< 0x00000004 */
#define PWR_CR4_SRAM1PDS6                   PWR_CR4_SRAM1PDS6_Msk                   /*!< SRAM1 page 6 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM1PDS7_Pos               (3U)
#define PWR_CR4_SRAM1PDS7_Msk               (0x1UL << PWR_CR4_SRAM1PDS7_Pos)        /*!< 0x00000008 */
#define PWR_CR4_SRAM1PDS7                   PWR_CR4_SRAM1PDS7_Msk                   /*!< SRAM1 page 7 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM1PDS8_Pos               (4U)
#define PWR_CR4_SRAM1PDS8_Msk               (0x1UL << PWR_CR4_SRAM1PDS8_Pos)        /*!< 0x00000010 */
#define PWR_CR4_SRAM1PDS8                   PWR_CR4_SRAM1PDS8_Msk                   /*!< SRAM1 page 8 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM1PDS9_Pos               (5U)
#define PWR_CR4_SRAM1PDS9_Msk               (0x1UL << PWR_CR4_SRAM1PDS9_Pos)        /*!< 0x00000020 */
#define PWR_CR4_SRAM1PDS9                   PWR_CR4_SRAM1PDS9_Msk                   /*!< SRAM1 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM1PDS10_Pos              (6U)
#define PWR_CR4_SRAM1PDS10_Msk              (0x1UL << PWR_CR4_SRAM1PDS10_Pos)       /*!< 0x00000040 */
#define PWR_CR4_SRAM1PDS10                  PWR_CR4_SRAM1PDS10_Msk                  /*!< SRAM1 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM1PDS11_Pos              (7U)
#define PWR_CR4_SRAM1PDS11_Msk              (0x1UL << PWR_CR4_SRAM1PDS11_Pos)       /*!< 0x00000080 */
#define PWR_CR4_SRAM1PDS11                  PWR_CR4_SRAM1PDS11_Msk                  /*!< SRAM1 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM1PDS12_Pos              (8U)
#define PWR_CR4_SRAM1PDS12_Msk              (0x1UL << PWR_CR4_SRAM1PDS12_Pos)       /*!< 0x00000100 */
#define PWR_CR4_SRAM1PDS12                  PWR_CR4_SRAM1PDS12_Msk                  /*!< SRAM1 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM3PDS9_Pos               (10U)
#define PWR_CR4_SRAM3PDS9_Msk               (0x1UL << PWR_CR4_SRAM3PDS9_Pos)        /*!< 0x00000400 */
#define PWR_CR4_SRAM3PDS9                   PWR_CR4_SRAM3PDS9_Msk                   /*!< SRAM3 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM3PDS10_Pos              (11U)
#define PWR_CR4_SRAM3PDS10_Msk              (0x1UL << PWR_CR4_SRAM3PDS10_Pos)       /*!< 0x00000800 */
#define PWR_CR4_SRAM3PDS10                  PWR_CR4_SRAM3PDS10_Msk                  /*!< SRAM3 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM3PDS11_Pos              (12U)
#define PWR_CR4_SRAM3PDS11_Msk              (0x1UL << PWR_CR4_SRAM3PDS11_Pos)       /*!< 0x00001000 */
#define PWR_CR4_SRAM3PDS11                  PWR_CR4_SRAM3PDS11_Msk                  /*!< SRAM3 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM3PDS12_Pos              (13U)
#define PWR_CR4_SRAM3PDS12_Msk              (0x1UL << PWR_CR4_SRAM3PDS12_Pos)       /*!< 0x00002000 */
#define PWR_CR4_SRAM3PDS12                  PWR_CR4_SRAM3PDS12_Msk                  /*!< SRAM3 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM3PDS13_Pos              (14U)
#define PWR_CR4_SRAM3PDS13_Msk              (0x1UL << PWR_CR4_SRAM3PDS13_Pos)       /*!< 0x00004000 */
#define PWR_CR4_SRAM3PDS13                  PWR_CR4_SRAM3PDS13_Msk                  /*!< SRAM3 page 13 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM5PDS1_Pos               (16U)
#define PWR_CR4_SRAM5PDS1_Msk               (0x1UL << PWR_CR4_SRAM5PDS1_Pos)        /*!< 0x00010000 */
#define PWR_CR4_SRAM5PDS1                   PWR_CR4_SRAM5PDS1_Msk                   /*!< SRAM5 page 1 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS2_Pos               (17U)
#define PWR_CR4_SRAM5PDS2_Msk               (0x1UL << PWR_CR4_SRAM5PDS2_Pos)        /*!< 0x00020000 */
#define PWR_CR4_SRAM5PDS2                   PWR_CR4_SRAM5PDS2_Msk                   /*!< SRAM5 page 2 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS3_Pos               (18U)
#define PWR_CR4_SRAM5PDS3_Msk               (0x1UL << PWR_CR4_SRAM5PDS3_Pos)        /*!< 0x00040000 */
#define PWR_CR4_SRAM5PDS3                   PWR_CR4_SRAM5PDS3_Msk                   /*!< SRAM5 page 3 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS4_Pos               (19U)
#define PWR_CR4_SRAM5PDS4_Msk               (0x1UL << PWR_CR4_SRAM5PDS4_Pos)        /*!< 0x00080000 */
#define PWR_CR4_SRAM5PDS4                   PWR_CR4_SRAM5PDS4_Msk                   /*!< SRAM5 page 4 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS5_Pos               (20U)
#define PWR_CR4_SRAM5PDS5_Msk               (0x1UL << PWR_CR4_SRAM5PDS5_Pos)        /*!< 0x00100000 */
#define PWR_CR4_SRAM5PDS5                   PWR_CR4_SRAM5PDS5_Msk                   /*!< SRAM5 page 5 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS6_Pos               (21U)
#define PWR_CR4_SRAM5PDS6_Msk               (0x1UL << PWR_CR4_SRAM5PDS6_Pos)        /*!< 0x00200000 */
#define PWR_CR4_SRAM5PDS6                   PWR_CR4_SRAM5PDS6_Msk                   /*!< SRAM5 page 6 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS7_Pos               (22U)
#define PWR_CR4_SRAM5PDS7_Msk               (0x1UL << PWR_CR4_SRAM5PDS7_Pos)        /*!< 0x00400000 */
#define PWR_CR4_SRAM5PDS7                   PWR_CR4_SRAM5PDS7_Msk                   /*!< SRAM5 page 7 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS8_Pos               (23U)
#define PWR_CR4_SRAM5PDS8_Msk               (0x1UL << PWR_CR4_SRAM5PDS8_Pos)        /*!< 0x00800000 */
#define PWR_CR4_SRAM5PDS8                   PWR_CR4_SRAM5PDS8_Msk                   /*!< SRAM5 page 8 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS9_Pos               (24U)
#define PWR_CR4_SRAM5PDS9_Msk               (0x1UL << PWR_CR4_SRAM5PDS9_Pos)        /*!< 0x01000000 */
#define PWR_CR4_SRAM5PDS9                   PWR_CR4_SRAM5PDS9_Msk                   /*!< SRAM5 page 9 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3)  */
#define PWR_CR4_SRAM5PDS10_Pos              (25U)
#define PWR_CR4_SRAM5PDS10_Msk              (0x1UL << PWR_CR4_SRAM5PDS10_Pos)       /*!< 0x02000000 */
#define PWR_CR4_SRAM5PDS10                  PWR_CR4_SRAM5PDS10_Msk                  /*!< SRAM5 page 10 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM5PDS11_Pos              (26U)
#define PWR_CR4_SRAM5PDS11_Msk              (0x1UL << PWR_CR4_SRAM5PDS11_Pos)       /*!< 0x04000000 */
#define PWR_CR4_SRAM5PDS11                  PWR_CR4_SRAM5PDS11_Msk                  /*!< SRAM5 page 11 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM5PDS12_Pos              (27U)
#define PWR_CR4_SRAM5PDS12_Msk              (0x1UL << PWR_CR4_SRAM5PDS12_Pos)       /*!< 0x08000000 */
#define PWR_CR4_SRAM5PDS12                  PWR_CR4_SRAM5PDS12_Msk                  /*!< SRAM5 page 12 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */
#define PWR_CR4_SRAM5PDS13_Pos              (28U)
#define PWR_CR4_SRAM5PDS13_Msk              (0x1UL << PWR_CR4_SRAM5PDS13_Pos)       /*!< 0x10000000 */
#define PWR_CR4_SRAM5PDS13                  PWR_CR4_SRAM5PDS13_Msk                  /*!< SRAM5 page 13 (64 KB) power-down in Stop modes (Stop 0, 1, 2, 3) */

/******************************************************************************/
/*                                                                            */
/*                      SRAMs configuration controller                        */
/*                                                                            */
/******************************************************************************/
/*******************  Bit definition for RAMCFG_CR register  ******************/
#define RAMCFG_CR_ECCE_Pos                  (0U)
#define RAMCFG_CR_ECCE_Msk                  (0x1UL << RAMCFG_CR_ECCE_Pos)           /*!< 0x00000001 */
#define RAMCFG_CR_ECCE                      RAMCFG_CR_ECCE_Msk                      /*!< ECC Enable */
#define RAMCFG_CR_ALE_Pos                   (4U)
#define RAMCFG_CR_ALE_Msk                   (0x1UL << RAMCFG_CR_ALE_Pos)            /*!< 0x00000010 */
#define RAMCFG_CR_ALE                       RAMCFG_CR_ALE_Msk                       /*!< Address Latching Enable */
#define RAMCFG_CR_SRAMER_Pos                (8U)
#define RAMCFG_CR_SRAMER_Msk                (0x1UL << RAMCFG_CR_SRAMER_Pos)         /*!< 0x00000100 */
#define RAMCFG_CR_SRAMER                    RAMCFG_CR_SRAMER_Msk                    /*!< Start Erase */
#define RAMCFG_CR_WSC_Pos                   (16U)
#define RAMCFG_CR_WSC_Msk                   (0x7UL << RAMCFG_CR_WSC_Pos)            /*!< 0x00070000 */
#define RAMCFG_CR_WSC                       RAMCFG_CR_WSC_Msk                       /*!< WSC[18:16] Wait State Configuration field */
#define RAMCFG_CR_WSC_0                     (0x1UL << RAMCFG_CR_WSC_Pos)            /*!< 0x00010000 */
#define RAMCFG_CR_WSC_1                     (0x2UL << RAMCFG_CR_WSC_Pos)            /*!< 0x00020000 */
#define RAMCFG_CR_WSC_2                     (0x4UL << RAMCFG_CR_WSC_Pos)            /*!< 0x00040000 */

/*******************  Bit definition for RAMCFG_IER register  *****************/
#define RAMCFG_IER_SEIE_Pos                 (0U)
#define RAMCFG_IER_SEIE_Msk                 (0x1UL << RAMCFG_IER_SEIE_Pos)          /*!< 0x00000001 */
#define RAMCFG_IER_SEIE                     RAMCFG_IER_SEIE_Msk                     /*!< Single Error Interrupt Enable */
#define RAMCFG_IER_DEIE_Pos                 (1U)
#define RAMCFG_IER_DEIE_Msk                 (0x1UL << RAMCFG_IER_DEIE_Pos)          /*!< 0x00000002 */
#define RAMCFG_IER_DEIE                     RAMCFG_IER_DEIE_Msk                     /*!< Double Error Interrupt Enable */
#define RAMCFG_IER_ECCNMI_Pos               (3U)
#define RAMCFG_IER_ECCNMI_Msk               (0x1UL << RAMCFG_IER_ECCNMI_Pos)        /*!< 0x00000008 */
#define RAMCFG_IER_ECCNMI                   RAMCFG_IER_ECCNMI_Msk                   /*!< NMI redirection interrupt */

/*******************  Bit definition for RAMCFG_ISR register  *****************/
#define RAMCFG_ISR_SEDC_Pos                 (0U)
#define RAMCFG_ISR_SEDC_Msk                 (0x1UL << RAMCFG_ISR_SEDC_Pos)          /*!< 0x00000001 */
#define RAMCFG_ISR_SEDC                     RAMCFG_ISR_SEDC_Msk                     /*!< Single Error Detected and Corrected flag */
#define RAMCFG_ISR_DED_Pos                  (1U)
#define RAMCFG_ISR_DED_Msk                  (0x1UL << RAMCFG_ISR_DED_Pos)           /*!< 0x00000002 */
#define RAMCFG_ISR_DED                      RAMCFG_ISR_DED_Msk                      /*!< Double Error Detected flag */
#define RAMCFG_ISR_SRAMBUSY_Pos             (8U)
#define RAMCFG_ISR_SRAMBUSY_Msk             (0x1UL << RAMCFG_ISR_SRAMBUSY_Pos)      /*!< 0x00000100 */
#define RAMCFG_ISR_SRAMBUSY                 RAMCFG_ISR_SRAMBUSY_Msk                 /*!< SRAM busy flag */

